/* automatically generated by rust-bindgen 0.69.1 */

pub const _STDIO_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 31;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __LONG_DOUBLE_USES_FLOAT128: u32 = 0;
pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const __GLIBC_USE_LIB_EXT2: u32 = 0;

pub const TA_FUNC_FLG_VOLUME: u32 = 67108864;
pub const TA_FUNC_FLG_UNST_PER: u32 = 134217728;
pub const TA_FUNC_FLG_CANDLESTICK: u32 = 268435456;
pub const TA_IN_PRICE_OPEN: u32 = 1;
pub const TA_IN_PRICE_HIGH: u32 = 2;
pub const TA_IN_PRICE_LOW: u32 = 4;
pub const TA_IN_PRICE_CLOSE: u32 = 8;
pub const TA_IN_PRICE_VOLUME: u32 = 16;
pub const TA_IN_PRICE_OPENINTEREST: u32 = 32;
pub const TA_IN_PRICE_TIMESTAMP: u32 = 64;
pub const TA_OPTIN_IS_PERCENT: u32 = 1048576;
pub const TA_OPTIN_IS_DEGREE: u32 = 2097152;
pub const TA_OPTIN_IS_CURRENCY: u32 = 4194304;
pub const TA_OPTIN_ADVANCED: u32 = 16777216;
pub const TA_OUT_LINE: u32 = 1;
pub const TA_OUT_DOT_LINE: u32 = 2;
pub const TA_OUT_DASH_LINE: u32 = 4;
pub const TA_OUT_DOT: u32 = 8;
pub const TA_OUT_HISTO: u32 = 16;
pub const TA_OUT_PATTERN_BOOL: u32 = 32;
pub const TA_OUT_PATTERN_BULL_BEAR: u32 = 64;
pub const TA_OUT_PATTERN_STRENGTH: u32 = 128;
pub const TA_OUT_POSITIVE: u32 = 256;
pub const TA_OUT_NEGATIVE: u32 = 512;
pub const TA_OUT_ZERO: u32 = 1024;
pub const TA_OUT_UPPER_LIMIT: u32 = 2048;
pub const TA_OUT_LOWER_LIMIT: u32 = 4096;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos64_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_FILE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._codecvt) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wide_data) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_list) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_buf) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad5) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type off_t = __off_t;
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub static mut sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    pub static sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub type Int32 = ::std::os::raw::c_int;
pub type UInt32 = ::std::os::raw::c_uint;
pub type Int64 = ::std::os::raw::c_long;
pub type UInt64 = ::std::os::raw::c_ulong;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum TA_RetCode {
    TA_SUCCESS = 0,
    TA_LIB_NOT_INITIALIZE = 1,
    TA_BAD_PARAM = 2,
    TA_ALLOC_ERR = 3,
    TA_GROUP_NOT_FOUND = 4,
    TA_FUNC_NOT_FOUND = 5,
    TA_INVALID_HANDLE = 6,
    TA_INVALID_PARAM_HOLDER = 7,
    TA_INVALID_PARAM_HOLDER_TYPE = 8,
    TA_INVALID_PARAM_FUNCTION = 9,
    TA_INPUT_NOT_ALL_INITIALIZE = 10,
    TA_OUTPUT_NOT_ALL_INITIALIZE = 11,
    TA_OUT_OF_RANGE_START_INDEX = 12,
    TA_OUT_OF_RANGE_END_INDEX = 13,
    TA_INVALID_LIST_TYPE = 14,
    TA_BAD_OBJECT = 15,
    TA_NOT_SUPPORTED = 16,
    TA_INTERNAL_ERROR = 5000,
    TA_UNKNOWN_ERR = 65535,
}
pub const TA_Compatibility_TA_COMPATIBILITY_DEFAULT: TA_Compatibility = 0;
pub const TA_Compatibility_TA_COMPATIBILITY_METASTOCK: TA_Compatibility = 1;
pub type TA_Compatibility = ::std::os::raw::c_uint;
pub const TA_MAType_TA_MAType_SMA: TA_MAType = 0;
pub const TA_MAType_TA_MAType_EMA: TA_MAType = 1;
pub const TA_MAType_TA_MAType_WMA: TA_MAType = 2;
pub const TA_MAType_TA_MAType_DEMA: TA_MAType = 3;
pub const TA_MAType_TA_MAType_TEMA: TA_MAType = 4;
pub const TA_MAType_TA_MAType_TRIMA: TA_MAType = 5;
pub const TA_MAType_TA_MAType_KAMA: TA_MAType = 6;
pub const TA_MAType_TA_MAType_MAMA: TA_MAType = 7;
pub const TA_MAType_TA_MAType_T3: TA_MAType = 8;
pub type TA_MAType = ::std::os::raw::c_uint;
pub const TA_FuncUnstId_TA_FUNC_UNST_ADX: TA_FuncUnstId = 0;
pub const TA_FuncUnstId_TA_FUNC_UNST_ADXR: TA_FuncUnstId = 1;
pub const TA_FuncUnstId_TA_FUNC_UNST_ATR: TA_FuncUnstId = 2;
pub const TA_FuncUnstId_TA_FUNC_UNST_CMO: TA_FuncUnstId = 3;
pub const TA_FuncUnstId_TA_FUNC_UNST_DX: TA_FuncUnstId = 4;
pub const TA_FuncUnstId_TA_FUNC_UNST_EMA: TA_FuncUnstId = 5;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_DCPERIOD: TA_FuncUnstId = 6;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_DCPHASE: TA_FuncUnstId = 7;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_PHASOR: TA_FuncUnstId = 8;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_SINE: TA_FuncUnstId = 9;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_TRENDLINE: TA_FuncUnstId = 10;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_TRENDMODE: TA_FuncUnstId = 11;
pub const TA_FuncUnstId_TA_FUNC_UNST_KAMA: TA_FuncUnstId = 12;
pub const TA_FuncUnstId_TA_FUNC_UNST_MAMA: TA_FuncUnstId = 13;
pub const TA_FuncUnstId_TA_FUNC_UNST_MFI: TA_FuncUnstId = 14;
pub const TA_FuncUnstId_TA_FUNC_UNST_MINUS_DI: TA_FuncUnstId = 15;
pub const TA_FuncUnstId_TA_FUNC_UNST_MINUS_DM: TA_FuncUnstId = 16;
pub const TA_FuncUnstId_TA_FUNC_UNST_NATR: TA_FuncUnstId = 17;
pub const TA_FuncUnstId_TA_FUNC_UNST_PLUS_DI: TA_FuncUnstId = 18;
pub const TA_FuncUnstId_TA_FUNC_UNST_PLUS_DM: TA_FuncUnstId = 19;
pub const TA_FuncUnstId_TA_FUNC_UNST_RSI: TA_FuncUnstId = 20;
pub const TA_FuncUnstId_TA_FUNC_UNST_STOCHRSI: TA_FuncUnstId = 21;
pub const TA_FuncUnstId_TA_FUNC_UNST_T3: TA_FuncUnstId = 22;
pub const TA_FuncUnstId_TA_FUNC_UNST_ALL: TA_FuncUnstId = 23;
pub const TA_FuncUnstId_TA_FUNC_UNST_NONE: TA_FuncUnstId = -1;
pub type TA_FuncUnstId = ::std::os::raw::c_int;
pub const TA_RangeType_TA_RangeType_RealBody: TA_RangeType = 0;
pub const TA_RangeType_TA_RangeType_HighLow: TA_RangeType = 1;
pub const TA_RangeType_TA_RangeType_Shadows: TA_RangeType = 2;
pub type TA_RangeType = ::std::os::raw::c_uint;
pub const TA_CandleSettingType_TA_BodyLong: TA_CandleSettingType = 0;
pub const TA_CandleSettingType_TA_BodyVeryLong: TA_CandleSettingType = 1;
pub const TA_CandleSettingType_TA_BodyShort: TA_CandleSettingType = 2;
pub const TA_CandleSettingType_TA_BodyDoji: TA_CandleSettingType = 3;
pub const TA_CandleSettingType_TA_ShadowLong: TA_CandleSettingType = 4;
pub const TA_CandleSettingType_TA_ShadowVeryLong: TA_CandleSettingType = 5;
pub const TA_CandleSettingType_TA_ShadowShort: TA_CandleSettingType = 6;
pub const TA_CandleSettingType_TA_ShadowVeryShort: TA_CandleSettingType = 7;
pub const TA_CandleSettingType_TA_Near: TA_CandleSettingType = 8;
pub const TA_CandleSettingType_TA_Far: TA_CandleSettingType = 9;
pub const TA_CandleSettingType_TA_Equal: TA_CandleSettingType = 10;
pub const TA_CandleSettingType_TA_AllCandleSettings: TA_CandleSettingType = 11;
pub type TA_CandleSettingType = ::std::os::raw::c_uint;
extern "C" {
    pub fn TA_GetVersionString() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TA_GetVersionMajor() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TA_GetVersionMinor() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TA_GetVersionBuild() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TA_GetVersionDate() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TA_GetVersionTime() -> *const ::std::os::raw::c_char;
}
pub type TA_Real = f64;
pub type TA_Integer = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_StringTable {
    pub size: ::std::os::raw::c_uint,
    pub string: *mut *const ::std::os::raw::c_char,
    pub hiddenData: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_TA_StringTable() {
    const UNINIT: ::std::mem::MaybeUninit<TA_StringTable> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_StringTable>(),
        24usize,
        concat!("Size of: ", stringify!(TA_StringTable))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_StringTable>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_StringTable))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_StringTable),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).string) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_StringTable),
            "::",
            stringify!(string)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hiddenData) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_StringTable),
            "::",
            stringify!(hiddenData)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_RetCodeInfo {
    pub enumStr: *const ::std::os::raw::c_char,
    pub infoStr: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_TA_RetCodeInfo() {
    const UNINIT: ::std::mem::MaybeUninit<TA_RetCodeInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_RetCodeInfo>(),
        16usize,
        concat!("Size of: ", stringify!(TA_RetCodeInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_RetCodeInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_RetCodeInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enumStr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RetCodeInfo),
            "::",
            stringify!(enumStr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).infoStr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RetCodeInfo),
            "::",
            stringify!(infoStr)
        )
    );
}
extern "C" {
    pub fn TA_SetRetCodeInfo(theRetCode: TA_RetCode, retCodeInfo: *mut TA_RetCodeInfo);
}
extern "C" {
    pub fn TA_Initialize() -> TA_RetCode;
}
extern "C" {
    pub fn TA_Shutdown() -> TA_RetCode;
}
extern "C" {
    pub fn TA_GroupTableAlloc(table: *mut *mut TA_StringTable) -> TA_RetCode;
}
extern "C" {
    pub fn TA_GroupTableFree(table: *mut TA_StringTable) -> TA_RetCode;
}
extern "C" {
    pub fn TA_FuncTableAlloc(
        group: *const ::std::os::raw::c_char,
        table: *mut *mut TA_StringTable,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_FuncTableFree(table: *mut TA_StringTable) -> TA_RetCode;
}
pub type TA_FuncHandle = ::std::os::raw::c_uint;
extern "C" {
    pub fn TA_GetFuncHandle(
        name: *const ::std::os::raw::c_char,
        handle: *mut *const TA_FuncHandle,
    ) -> TA_RetCode;
}
pub type TA_FuncFlags = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_FuncInfo {
    pub name: *const ::std::os::raw::c_char,
    pub group: *const ::std::os::raw::c_char,
    pub hint: *const ::std::os::raw::c_char,
    pub camelCaseName: *const ::std::os::raw::c_char,
    pub flags: TA_FuncFlags,
    pub nbInput: ::std::os::raw::c_uint,
    pub nbOptInput: ::std::os::raw::c_uint,
    pub nbOutput: ::std::os::raw::c_uint,
    pub handle: *const TA_FuncHandle,
}
#[test]
fn bindgen_test_layout_TA_FuncInfo() {
    const UNINIT: ::std::mem::MaybeUninit<TA_FuncInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_FuncInfo>(),
        56usize,
        concat!("Size of: ", stringify!(TA_FuncInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_FuncInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_FuncInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).group) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hint) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(hint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).camelCaseName) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(camelCaseName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nbInput) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(nbInput)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nbOptInput) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(nbOptInput)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nbOutput) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(nbOutput)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_FuncInfo),
            "::",
            stringify!(handle)
        )
    );
}
extern "C" {
    pub fn TA_GetFuncInfo(
        handle: *const TA_FuncHandle,
        funcInfo: *mut *const TA_FuncInfo,
    ) -> TA_RetCode;
}
pub type TA_CallForEachFunc = ::std::option::Option<
    unsafe extern "C" fn(funcInfo: *const TA_FuncInfo, opaqueData: *mut ::std::os::raw::c_void),
>;
extern "C" {
    pub fn TA_ForEachFunc(
        functionToCall: TA_CallForEachFunc,
        opaqueData: *mut ::std::os::raw::c_void,
    ) -> TA_RetCode;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_RealRange {
    pub min: TA_Real,
    pub max: TA_Real,
    pub precision: TA_Integer,
    pub suggested_start: TA_Real,
    pub suggested_end: TA_Real,
    pub suggested_increment: TA_Real,
}
#[test]
fn bindgen_test_layout_TA_RealRange() {
    const UNINIT: ::std::mem::MaybeUninit<TA_RealRange> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_RealRange>(),
        48usize,
        concat!("Size of: ", stringify!(TA_RealRange))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_RealRange>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_RealRange))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealRange),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealRange),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).precision) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealRange),
            "::",
            stringify!(precision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suggested_start) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealRange),
            "::",
            stringify!(suggested_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suggested_end) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealRange),
            "::",
            stringify!(suggested_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suggested_increment) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealRange),
            "::",
            stringify!(suggested_increment)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_IntegerRange {
    pub min: TA_Integer,
    pub max: TA_Integer,
    pub suggested_start: TA_Integer,
    pub suggested_end: TA_Integer,
    pub suggested_increment: TA_Integer,
}
#[test]
fn bindgen_test_layout_TA_IntegerRange() {
    const UNINIT: ::std::mem::MaybeUninit<TA_IntegerRange> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_IntegerRange>(),
        20usize,
        concat!("Size of: ", stringify!(TA_IntegerRange))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_IntegerRange>(),
        4usize,
        concat!("Alignment of ", stringify!(TA_IntegerRange))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerRange),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerRange),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suggested_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerRange),
            "::",
            stringify!(suggested_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suggested_end) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerRange),
            "::",
            stringify!(suggested_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suggested_increment) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerRange),
            "::",
            stringify!(suggested_increment)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_RealDataPair {
    pub value: TA_Real,
    pub string: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_TA_RealDataPair() {
    const UNINIT: ::std::mem::MaybeUninit<TA_RealDataPair> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_RealDataPair>(),
        16usize,
        concat!("Size of: ", stringify!(TA_RealDataPair))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_RealDataPair>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_RealDataPair))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealDataPair),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).string) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealDataPair),
            "::",
            stringify!(string)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_IntegerDataPair {
    pub value: TA_Integer,
    pub string: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_TA_IntegerDataPair() {
    const UNINIT: ::std::mem::MaybeUninit<TA_IntegerDataPair> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_IntegerDataPair>(),
        16usize,
        concat!("Size of: ", stringify!(TA_IntegerDataPair))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_IntegerDataPair>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_IntegerDataPair))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerDataPair),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).string) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerDataPair),
            "::",
            stringify!(string)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_RealList {
    pub data: *const TA_RealDataPair,
    pub nbElement: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_TA_RealList() {
    const UNINIT: ::std::mem::MaybeUninit<TA_RealList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_RealList>(),
        16usize,
        concat!("Size of: ", stringify!(TA_RealList))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_RealList>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_RealList))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealList),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nbElement) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_RealList),
            "::",
            stringify!(nbElement)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_IntegerList {
    pub data: *const TA_IntegerDataPair,
    pub nbElement: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_TA_IntegerList() {
    const UNINIT: ::std::mem::MaybeUninit<TA_IntegerList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_IntegerList>(),
        16usize,
        concat!("Size of: ", stringify!(TA_IntegerList))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_IntegerList>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_IntegerList))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerList),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nbElement) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_IntegerList),
            "::",
            stringify!(nbElement)
        )
    );
}
pub const TA_InputParameterType_TA_Input_Price: TA_InputParameterType = 0;
pub const TA_InputParameterType_TA_Input_Real: TA_InputParameterType = 1;
pub const TA_InputParameterType_TA_Input_Integer: TA_InputParameterType = 2;
pub type TA_InputParameterType = ::std::os::raw::c_uint;
pub const TA_OptInputParameterType_TA_OptInput_RealRange: TA_OptInputParameterType = 0;
pub const TA_OptInputParameterType_TA_OptInput_RealList: TA_OptInputParameterType = 1;
pub const TA_OptInputParameterType_TA_OptInput_IntegerRange: TA_OptInputParameterType = 2;
pub const TA_OptInputParameterType_TA_OptInput_IntegerList: TA_OptInputParameterType = 3;
pub type TA_OptInputParameterType = ::std::os::raw::c_uint;
pub const TA_OutputParameterType_TA_Output_Real: TA_OutputParameterType = 0;
pub const TA_OutputParameterType_TA_Output_Integer: TA_OutputParameterType = 1;
pub type TA_OutputParameterType = ::std::os::raw::c_uint;
pub type TA_InputFlags = ::std::os::raw::c_int;
pub type TA_OptInputFlags = ::std::os::raw::c_int;
pub type TA_OutputFlags = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_InputParameterInfo {
    pub type_: TA_InputParameterType,
    pub paramName: *const ::std::os::raw::c_char,
    pub flags: TA_InputFlags,
}
#[test]
fn bindgen_test_layout_TA_InputParameterInfo() {
    const UNINIT: ::std::mem::MaybeUninit<TA_InputParameterInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_InputParameterInfo>(),
        24usize,
        concat!("Size of: ", stringify!(TA_InputParameterInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_InputParameterInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_InputParameterInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_InputParameterInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).paramName) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_InputParameterInfo),
            "::",
            stringify!(paramName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_InputParameterInfo),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_OptInputParameterInfo {
    pub type_: TA_OptInputParameterType,
    pub paramName: *const ::std::os::raw::c_char,
    pub flags: TA_OptInputFlags,
    pub displayName: *const ::std::os::raw::c_char,
    pub dataSet: *const ::std::os::raw::c_void,
    pub defaultValue: TA_Real,
    pub hint: *const ::std::os::raw::c_char,
    pub helpFile: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_TA_OptInputParameterInfo() {
    const UNINIT: ::std::mem::MaybeUninit<TA_OptInputParameterInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_OptInputParameterInfo>(),
        64usize,
        concat!("Size of: ", stringify!(TA_OptInputParameterInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_OptInputParameterInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_OptInputParameterInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OptInputParameterInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).paramName) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OptInputParameterInfo),
            "::",
            stringify!(paramName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OptInputParameterInfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).displayName) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OptInputParameterInfo),
            "::",
            stringify!(displayName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataSet) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OptInputParameterInfo),
            "::",
            stringify!(dataSet)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).defaultValue) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OptInputParameterInfo),
            "::",
            stringify!(defaultValue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hint) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OptInputParameterInfo),
            "::",
            stringify!(hint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).helpFile) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OptInputParameterInfo),
            "::",
            stringify!(helpFile)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_OutputParameterInfo {
    pub type_: TA_OutputParameterType,
    pub paramName: *const ::std::os::raw::c_char,
    pub flags: TA_OutputFlags,
}
#[test]
fn bindgen_test_layout_TA_OutputParameterInfo() {
    const UNINIT: ::std::mem::MaybeUninit<TA_OutputParameterInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_OutputParameterInfo>(),
        24usize,
        concat!("Size of: ", stringify!(TA_OutputParameterInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_OutputParameterInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_OutputParameterInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OutputParameterInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).paramName) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OutputParameterInfo),
            "::",
            stringify!(paramName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_OutputParameterInfo),
            "::",
            stringify!(flags)
        )
    );
}
extern "C" {
    pub fn TA_GetInputParameterInfo(
        handle: *const TA_FuncHandle,
        paramIndex: ::std::os::raw::c_uint,
        info: *mut *const TA_InputParameterInfo,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_GetOptInputParameterInfo(
        handle: *const TA_FuncHandle,
        paramIndex: ::std::os::raw::c_uint,
        info: *mut *const TA_OptInputParameterInfo,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_GetOutputParameterInfo(
        handle: *const TA_FuncHandle,
        paramIndex: ::std::os::raw::c_uint,
        info: *mut *const TA_OutputParameterInfo,
    ) -> TA_RetCode;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_ParamHolder {
    pub hiddenData: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_TA_ParamHolder() {
    const UNINIT: ::std::mem::MaybeUninit<TA_ParamHolder> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<TA_ParamHolder>(),
        8usize,
        concat!("Size of: ", stringify!(TA_ParamHolder))
    );
    assert_eq!(
        ::std::mem::align_of::<TA_ParamHolder>(),
        8usize,
        concat!("Alignment of ", stringify!(TA_ParamHolder))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hiddenData) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TA_ParamHolder),
            "::",
            stringify!(hiddenData)
        )
    );
}
extern "C" {
    pub fn TA_ParamHolderAlloc(
        handle: *const TA_FuncHandle,
        allocatedParams: *mut *mut TA_ParamHolder,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_ParamHolderFree(params: *mut TA_ParamHolder) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SetInputParamIntegerPtr(
        params: *mut TA_ParamHolder,
        paramIndex: ::std::os::raw::c_uint,
        value: *const TA_Integer,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SetInputParamRealPtr(
        params: *mut TA_ParamHolder,
        paramIndex: ::std::os::raw::c_uint,
        value: *const TA_Real,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SetInputParamPricePtr(
        params: *mut TA_ParamHolder,
        paramIndex: ::std::os::raw::c_uint,
        open: *const TA_Real,
        high: *const TA_Real,
        low: *const TA_Real,
        close: *const TA_Real,
        volume: *const TA_Real,
        openInterest: *const TA_Real,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SetOptInputParamInteger(
        params: *mut TA_ParamHolder,
        paramIndex: ::std::os::raw::c_uint,
        optInValue: TA_Integer,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SetOptInputParamReal(
        params: *mut TA_ParamHolder,
        paramIndex: ::std::os::raw::c_uint,
        optInValue: TA_Real,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SetOutputParamIntegerPtr(
        params: *mut TA_ParamHolder,
        paramIndex: ::std::os::raw::c_uint,
        out: *mut TA_Integer,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SetOutputParamRealPtr(
        params: *mut TA_ParamHolder,
        paramIndex: ::std::os::raw::c_uint,
        out: *mut TA_Real,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_GetLookback(params: *const TA_ParamHolder, lookback: *mut TA_Integer) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CallFunc(
        params: *const TA_ParamHolder,
        startIdx: TA_Integer,
        endIdx: TA_Integer,
        outBegIdx: *mut TA_Integer,
        outNbElement: *mut TA_Integer,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_FunctionDescriptionXML() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn TA_ACOS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_ACOS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_ACOS_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_AD(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        inVolume: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_AD(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        inVolume: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_AD_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_ADD(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_ADD(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_ADD_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_ADOSC(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        inVolume: *const f64,
        optInFastPeriod: ::std::os::raw::c_int,
        optInSlowPeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_ADOSC(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        inVolume: *const f32,
        optInFastPeriod: ::std::os::raw::c_int,
        optInSlowPeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_ADOSC_Lookback(
        optInFastPeriod: ::std::os::raw::c_int,
        optInSlowPeriod: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_ADX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_ADX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_ADX_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_ADXR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_ADXR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_ADXR_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_APO(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInFastPeriod: ::std::os::raw::c_int,
        optInSlowPeriod: ::std::os::raw::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_APO(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInFastPeriod: ::std::os::raw::c_int,
        optInSlowPeriod: ::std::os::raw::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_APO_Lookback(
        optInFastPeriod: ::std::os::raw::c_int,
        optInSlowPeriod: ::std::os::raw::c_int,
        optInMAType: TA_MAType,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_AROON(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outAroonDown: *mut f64,
        outAroonUp: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_AROON(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outAroonDown: *mut f64,
        outAroonUp: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_AROON_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_AROONOSC(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_AROONOSC(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_AROONOSC_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_ASIN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_ASIN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_ASIN_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_ATAN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_ATAN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_ATAN_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_ATR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_ATR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_ATR_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_AVGPRICE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_AVGPRICE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_AVGPRICE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_BBANDS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        optInNbDevUp: f64,
        optInNbDevDn: f64,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outRealUpperBand: *mut f64,
        outRealMiddleBand: *mut f64,
        outRealLowerBand: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_BBANDS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        optInNbDevUp: f64,
        optInNbDevDn: f64,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outRealUpperBand: *mut f64,
        outRealMiddleBand: *mut f64,
        outRealLowerBand: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_BBANDS_Lookback(
        optInTimePeriod: ::std::os::raw::c_int,
        optInNbDevUp: f64,
        optInNbDevDn: f64,
        optInMAType: TA_MAType,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_BETA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_BETA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_BETA_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_BOP(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_BOP(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_BOP_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CCI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CCI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CCI_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDL2CROWS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDL2CROWS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDL2CROWS_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDL3BLACKCROWS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDL3BLACKCROWS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDL3BLACKCROWS_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDL3INSIDE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDL3INSIDE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDL3INSIDE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDL3LINESTRIKE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDL3LINESTRIKE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDL3LINESTRIKE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDL3OUTSIDE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDL3OUTSIDE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDL3OUTSIDE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDL3STARSINSOUTH(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDL3STARSINSOUTH(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDL3STARSINSOUTH_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDL3WHITESOLDIERS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDL3WHITESOLDIERS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDL3WHITESOLDIERS_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLABANDONEDBABY(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLABANDONEDBABY(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLABANDONEDBABY_Lookback(optInPenetration: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLADVANCEBLOCK(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLADVANCEBLOCK(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLADVANCEBLOCK_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLBELTHOLD(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLBELTHOLD(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLBELTHOLD_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLBREAKAWAY(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLBREAKAWAY(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLBREAKAWAY_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLCLOSINGMARUBOZU(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLCLOSINGMARUBOZU(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLCLOSINGMARUBOZU_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLCONCEALBABYSWALL(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLCONCEALBABYSWALL(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLCONCEALBABYSWALL_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLCOUNTERATTACK(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLCOUNTERATTACK(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLCOUNTERATTACK_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLDARKCLOUDCOVER(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLDARKCLOUDCOVER(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLDARKCLOUDCOVER_Lookback(optInPenetration: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLDOJI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLDOJI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLDOJI_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLDOJISTAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLDOJISTAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLDOJISTAR_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLDRAGONFLYDOJI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLDRAGONFLYDOJI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLDRAGONFLYDOJI_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLENGULFING(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLENGULFING(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLENGULFING_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLEVENINGDOJISTAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLEVENINGDOJISTAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLEVENINGDOJISTAR_Lookback(optInPenetration: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLEVENINGSTAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLEVENINGSTAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLEVENINGSTAR_Lookback(optInPenetration: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLGAPSIDESIDEWHITE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLGAPSIDESIDEWHITE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLGAPSIDESIDEWHITE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLGRAVESTONEDOJI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLGRAVESTONEDOJI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLGRAVESTONEDOJI_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLHAMMER(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLHAMMER(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLHAMMER_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLHANGINGMAN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLHANGINGMAN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLHANGINGMAN_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLHARAMI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLHARAMI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLHARAMI_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLHARAMICROSS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLHARAMICROSS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLHARAMICROSS_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLHIGHWAVE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLHIGHWAVE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLHIGHWAVE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLHIKKAKE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLHIKKAKE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLHIKKAKE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLHIKKAKEMOD(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLHIKKAKEMOD(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLHIKKAKEMOD_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLHOMINGPIGEON(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLHOMINGPIGEON(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLHOMINGPIGEON_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLIDENTICAL3CROWS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLIDENTICAL3CROWS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLIDENTICAL3CROWS_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLINNECK(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLINNECK(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLINNECK_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLINVERTEDHAMMER(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLINVERTEDHAMMER(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLINVERTEDHAMMER_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLKICKING(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLKICKING(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLKICKING_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLKICKINGBYLENGTH(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLKICKINGBYLENGTH(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLKICKINGBYLENGTH_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLLADDERBOTTOM(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLLADDERBOTTOM(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLLADDERBOTTOM_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLLONGLEGGEDDOJI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLLONGLEGGEDDOJI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLLONGLEGGEDDOJI_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLLONGLINE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLLONGLINE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLLONGLINE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLMARUBOZU(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLMARUBOZU(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLMARUBOZU_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLMATCHINGLOW(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLMATCHINGLOW(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLMATCHINGLOW_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLMATHOLD(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLMATHOLD(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLMATHOLD_Lookback(optInPenetration: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLMORNINGDOJISTAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLMORNINGDOJISTAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLMORNINGDOJISTAR_Lookback(optInPenetration: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLMORNINGSTAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLMORNINGSTAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLMORNINGSTAR_Lookback(optInPenetration: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLONNECK(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLONNECK(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLONNECK_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLPIERCING(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLPIERCING(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLPIERCING_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLRICKSHAWMAN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLRICKSHAWMAN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLRICKSHAWMAN_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLRISEFALL3METHODS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLRISEFALL3METHODS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLRISEFALL3METHODS_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLSEPARATINGLINES(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLSEPARATINGLINES(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLSEPARATINGLINES_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLSHOOTINGSTAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLSHOOTINGSTAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLSHOOTINGSTAR_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLSHORTLINE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLSHORTLINE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLSHORTLINE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLSPINNINGTOP(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLSPINNINGTOP(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLSPINNINGTOP_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLSTALLEDPATTERN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLSTALLEDPATTERN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLSTALLEDPATTERN_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLSTICKSANDWICH(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLSTICKSANDWICH(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLSTICKSANDWICH_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLTAKURI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLTAKURI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLTAKURI_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLTASUKIGAP(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLTASUKIGAP(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLTASUKIGAP_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLTHRUSTING(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLTHRUSTING(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLTHRUSTING_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLTRISTAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLTRISTAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLTRISTAR_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLUNIQUE3RIVER(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLUNIQUE3RIVER(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLUNIQUE3RIVER_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLUPSIDEGAP2CROWS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLUPSIDEGAP2CROWS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLUPSIDEGAP2CROWS_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CDLXSIDEGAP3METHODS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CDLXSIDEGAP3METHODS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CDLXSIDEGAP3METHODS_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CEIL(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CEIL(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CEIL_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CMO(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CMO(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CMO_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_CORREL(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_CORREL(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_CORREL_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_COS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_COS(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_COS_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_COSH(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_COSH(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_COSH_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_DEMA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_DEMA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_DEMA_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_DIV(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_DIV(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_DIV_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_DX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_DX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_DX_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_EMA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_EMA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_EMA_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_EXP(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_EXP(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_EXP_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_FLOOR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_FLOOR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_FLOOR_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_HT_DCPERIOD(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_HT_DCPERIOD(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_HT_DCPERIOD_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_HT_DCPHASE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_HT_DCPHASE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_HT_DCPHASE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_HT_PHASOR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInPhase: *mut f64,
        outQuadrature: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_HT_PHASOR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInPhase: *mut f64,
        outQuadrature: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_HT_PHASOR_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_HT_SINE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outSine: *mut f64,
        outLeadSine: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_HT_SINE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outSine: *mut f64,
        outLeadSine: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_HT_SINE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_HT_TRENDLINE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_HT_TRENDLINE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_HT_TRENDLINE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_HT_TRENDMODE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_HT_TRENDMODE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_HT_TRENDMODE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_KAMA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_KAMA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_KAMA_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_LINEARREG(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_LINEARREG(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_LINEARREG_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_LINEARREG_ANGLE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_LINEARREG_ANGLE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_LINEARREG_ANGLE_Lookback(
        optInTimePeriod: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_LINEARREG_INTERCEPT(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_LINEARREG_INTERCEPT(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_LINEARREG_INTERCEPT_Lookback(
        optInTimePeriod: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_LINEARREG_SLOPE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_LINEARREG_SLOPE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_LINEARREG_SLOPE_Lookback(
        optInTimePeriod: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_LN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_LN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_LN_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_LOG10(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_LOG10(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_LOG10_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MA_Lookback(
        optInTimePeriod: ::std::os::raw::c_int,
        optInMAType: TA_MAType,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MACD(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInFastPeriod: ::std::os::raw::c_int,
        optInSlowPeriod: ::std::os::raw::c_int,
        optInSignalPeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MACD(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInFastPeriod: ::std::os::raw::c_int,
        optInSlowPeriod: ::std::os::raw::c_int,
        optInSignalPeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MACD_Lookback(
        optInFastPeriod: ::std::os::raw::c_int,
        optInSlowPeriod: ::std::os::raw::c_int,
        optInSignalPeriod: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MACDEXT(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInFastPeriod: ::std::os::raw::c_int,
        optInFastMAType: TA_MAType,
        optInSlowPeriod: ::std::os::raw::c_int,
        optInSlowMAType: TA_MAType,
        optInSignalPeriod: ::std::os::raw::c_int,
        optInSignalMAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MACDEXT(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInFastPeriod: ::std::os::raw::c_int,
        optInFastMAType: TA_MAType,
        optInSlowPeriod: ::std::os::raw::c_int,
        optInSlowMAType: TA_MAType,
        optInSignalPeriod: ::std::os::raw::c_int,
        optInSignalMAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MACDEXT_Lookback(
        optInFastPeriod: ::std::os::raw::c_int,
        optInFastMAType: TA_MAType,
        optInSlowPeriod: ::std::os::raw::c_int,
        optInSlowMAType: TA_MAType,
        optInSignalPeriod: ::std::os::raw::c_int,
        optInSignalMAType: TA_MAType,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MACDFIX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInSignalPeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MACDFIX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInSignalPeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MACDFIX_Lookback(optInSignalPeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MAMA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInFastLimit: f64,
        optInSlowLimit: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outMAMA: *mut f64,
        outFAMA: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MAMA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInFastLimit: f64,
        optInSlowLimit: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outMAMA: *mut f64,
        outFAMA: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MAMA_Lookback(optInFastLimit: f64, optInSlowLimit: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MAVP(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        inPeriods: *const f64,
        optInMinPeriod: ::std::os::raw::c_int,
        optInMaxPeriod: ::std::os::raw::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MAVP(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        inPeriods: *const f32,
        optInMinPeriod: ::std::os::raw::c_int,
        optInMaxPeriod: ::std::os::raw::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MAVP_Lookback(
        optInMinPeriod: ::std::os::raw::c_int,
        optInMaxPeriod: ::std::os::raw::c_int,
        optInMAType: TA_MAType,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MAX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MAX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MAX_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MAXINDEX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MAXINDEX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MAXINDEX_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MEDPRICE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MEDPRICE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MEDPRICE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MFI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        inVolume: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MFI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        inVolume: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MFI_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MIDPOINT(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MIDPOINT(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MIDPOINT_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MIDPRICE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MIDPRICE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MIDPRICE_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MIN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MIN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MIN_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MININDEX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MININDEX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outInteger: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MININDEX_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MINMAX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outMin: *mut f64,
        outMax: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MINMAX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outMin: *mut f64,
        outMax: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MINMAX_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MINMAXINDEX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outMinIdx: *mut ::std::os::raw::c_int,
        outMaxIdx: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MINMAXINDEX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outMinIdx: *mut ::std::os::raw::c_int,
        outMaxIdx: *mut ::std::os::raw::c_int,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MINMAXINDEX_Lookback(optInTimePeriod: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MINUS_DI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MINUS_DI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MINUS_DI_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MINUS_DM(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MINUS_DM(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MINUS_DM_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MOM(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MOM(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MOM_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_MULT(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_MULT(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_MULT_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_NATR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_NATR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_NATR_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_OBV(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        inVolume: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_OBV(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        inVolume: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_OBV_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_PLUS_DI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_PLUS_DI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_PLUS_DI_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_PLUS_DM(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_PLUS_DM(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_PLUS_DM_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_PPO(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInFastPeriod: ::std::os::raw::c_int,
        optInSlowPeriod: ::std::os::raw::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_PPO(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInFastPeriod: ::std::os::raw::c_int,
        optInSlowPeriod: ::std::os::raw::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_PPO_Lookback(
        optInFastPeriod: ::std::os::raw::c_int,
        optInSlowPeriod: ::std::os::raw::c_int,
        optInMAType: TA_MAType,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_ROC(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_ROC(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_ROC_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_ROCP(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_ROCP(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_ROCP_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_ROCR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_ROCR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_ROCR_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_ROCR100(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_ROCR100(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_ROCR100_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_RSI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_RSI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_RSI_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_SAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInAcceleration: f64,
        optInMaximum: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_SAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInAcceleration: f64,
        optInMaximum: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SAR_Lookback(optInAcceleration: f64, optInMaximum: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_SAREXT(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInStartValue: f64,
        optInOffsetOnReverse: f64,
        optInAccelerationInitLong: f64,
        optInAccelerationLong: f64,
        optInAccelerationMaxLong: f64,
        optInAccelerationInitShort: f64,
        optInAccelerationShort: f64,
        optInAccelerationMaxShort: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_SAREXT(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInStartValue: f64,
        optInOffsetOnReverse: f64,
        optInAccelerationInitLong: f64,
        optInAccelerationLong: f64,
        optInAccelerationMaxLong: f64,
        optInAccelerationInitShort: f64,
        optInAccelerationShort: f64,
        optInAccelerationMaxShort: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SAREXT_Lookback(
        optInStartValue: f64,
        optInOffsetOnReverse: f64,
        optInAccelerationInitLong: f64,
        optInAccelerationLong: f64,
        optInAccelerationMaxLong: f64,
        optInAccelerationInitShort: f64,
        optInAccelerationShort: f64,
        optInAccelerationMaxShort: f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_SIN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_SIN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SIN_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_SINH(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_SINH(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SINH_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_SMA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_SMA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SMA_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_SQRT(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_SQRT(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SQRT_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_STDDEV(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        optInNbDev: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_STDDEV(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        optInNbDev: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_STDDEV_Lookback(
        optInTimePeriod: ::std::os::raw::c_int,
        optInNbDev: f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_STOCH(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInFastK_Period: ::std::os::raw::c_int,
        optInSlowK_Period: ::std::os::raw::c_int,
        optInSlowK_MAType: TA_MAType,
        optInSlowD_Period: ::std::os::raw::c_int,
        optInSlowD_MAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outSlowK: *mut f64,
        outSlowD: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_STOCH(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInFastK_Period: ::std::os::raw::c_int,
        optInSlowK_Period: ::std::os::raw::c_int,
        optInSlowK_MAType: TA_MAType,
        optInSlowD_Period: ::std::os::raw::c_int,
        optInSlowD_MAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outSlowK: *mut f64,
        outSlowD: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_STOCH_Lookback(
        optInFastK_Period: ::std::os::raw::c_int,
        optInSlowK_Period: ::std::os::raw::c_int,
        optInSlowK_MAType: TA_MAType,
        optInSlowD_Period: ::std::os::raw::c_int,
        optInSlowD_MAType: TA_MAType,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_STOCHF(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInFastK_Period: ::std::os::raw::c_int,
        optInFastD_Period: ::std::os::raw::c_int,
        optInFastD_MAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outFastK: *mut f64,
        outFastD: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_STOCHF(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInFastK_Period: ::std::os::raw::c_int,
        optInFastD_Period: ::std::os::raw::c_int,
        optInFastD_MAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outFastK: *mut f64,
        outFastD: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_STOCHF_Lookback(
        optInFastK_Period: ::std::os::raw::c_int,
        optInFastD_Period: ::std::os::raw::c_int,
        optInFastD_MAType: TA_MAType,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_STOCHRSI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        optInFastK_Period: ::std::os::raw::c_int,
        optInFastD_Period: ::std::os::raw::c_int,
        optInFastD_MAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outFastK: *mut f64,
        outFastD: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_STOCHRSI(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        optInFastK_Period: ::std::os::raw::c_int,
        optInFastD_Period: ::std::os::raw::c_int,
        optInFastD_MAType: TA_MAType,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outFastK: *mut f64,
        outFastD: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_STOCHRSI_Lookback(
        optInTimePeriod: ::std::os::raw::c_int,
        optInFastK_Period: ::std::os::raw::c_int,
        optInFastD_Period: ::std::os::raw::c_int,
        optInFastD_MAType: TA_MAType,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_SUB(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_SUB(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SUB_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_SUM(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_SUM(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_SUM_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_T3(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        optInVFactor: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_T3(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        optInVFactor: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_T3_Lookback(
        optInTimePeriod: ::std::os::raw::c_int,
        optInVFactor: f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_TAN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_TAN(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_TAN_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_TANH(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_TANH(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_TANH_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_TEMA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_TEMA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_TEMA_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_TRANGE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_TRANGE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_TRANGE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_TRIMA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_TRIMA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_TRIMA_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_TRIX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_TRIX(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_TRIX_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_TSF(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_TSF(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_TSF_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_TYPPRICE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_TYPPRICE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_TYPPRICE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_ULTOSC(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod1: ::std::os::raw::c_int,
        optInTimePeriod2: ::std::os::raw::c_int,
        optInTimePeriod3: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_ULTOSC(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod1: ::std::os::raw::c_int,
        optInTimePeriod2: ::std::os::raw::c_int,
        optInTimePeriod3: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_ULTOSC_Lookback(
        optInTimePeriod1: ::std::os::raw::c_int,
        optInTimePeriod2: ::std::os::raw::c_int,
        optInTimePeriod3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_VAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        optInNbDev: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_VAR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        optInNbDev: f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_VAR_Lookback(
        optInTimePeriod: ::std::os::raw::c_int,
        optInNbDev: f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_WCLPRICE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_WCLPRICE(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_WCLPRICE_Lookback() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_WILLR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_WILLR(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_WILLR_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_WMA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f64,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_S_WMA(
        startIdx: ::std::os::raw::c_int,
        endIdx: ::std::os::raw::c_int,
        inReal: *const f32,
        optInTimePeriod: ::std::os::raw::c_int,
        outBegIdx: *mut ::std::os::raw::c_int,
        outNBElement: *mut ::std::os::raw::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_WMA_Lookback(optInTimePeriod: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn TA_SetUnstablePeriod(
        id: TA_FuncUnstId,
        unstablePeriod: ::std::os::raw::c_uint,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_GetUnstablePeriod(id: TA_FuncUnstId) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn TA_SetCompatibility(value: TA_Compatibility) -> TA_RetCode;
}
extern "C" {
    pub fn TA_GetCompatibility() -> TA_Compatibility;
}
extern "C" {
    pub fn TA_SetCandleSettings(
        settingType: TA_CandleSettingType,
        rangeType: TA_RangeType,
        avgPeriod: ::std::os::raw::c_int,
        factor: f64,
    ) -> TA_RetCode;
}
extern "C" {
    pub fn TA_RestoreCandleDefaultSettings(settingType: TA_CandleSettingType) -> TA_RetCode;
}
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::std::os::raw::c_uint,
    pub fp_offset: ::std::os::raw::c_uint,
    pub overflow_arg_area: *mut ::std::os::raw::c_void,
    pub reg_save_area: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout___va_list_tag() {
    const UNINIT: ::std::mem::MaybeUninit<__va_list_tag> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__va_list_tag>(),
        24usize,
        concat!("Size of: ", stringify!(__va_list_tag))
    );
    assert_eq!(
        ::std::mem::align_of::<__va_list_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__va_list_tag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gp_offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(gp_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fp_offset) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(fp_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).overflow_arg_area) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(overflow_arg_area)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reg_save_area) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__va_list_tag),
            "::",
            stringify!(reg_save_area)
        )
    );
}
